function [J, grad] = lrCostFunction(theta, X, y, lambda)
%LRCOSTFUNCTION Вычисляет значение и градиент функции стоимости для
%логистической регрессии с регуляризацией

% Инициализация полезных переменных
m = length(y); % количество обучающих примеров

% Вы должны вернуть корректные значения следующих переменных
J = 0;
grad = zeros(size(theta));

% ====================== НАЧАЛО ВАШЕГО КОДА ======================

% Расчет значения функции стоимости
h = sigmoid(X*theta);
J = (1/m) * sum(-y.*log(h) - (1-y).*log(1-h)) + (lambda/(2*m)) * sum(theta(2:end).^2);

% Расчет градиента
grad = (1/m) * (X'*(h-y));
grad(2:end) = grad(2:end) + (lambda/m) * theta(2:end);

% ====================== КОНЕЦ ВАШЕГО КОДА ======================

grad = grad(:);

end
